#+TITLE: API Gateway test-client
#+AUTHOR: SciBourne
#+EMAIL: bourne-sci-hack@yandex.ru

#+LANGUAGE: en
#+PROPERTY: results silent
#+STARTUP: overview
#+STARTUP: indent
#+STARTUP: hidestars



#+NAME: rest-entry-point
: http://127.0.0.1:8000/rest/v1

#+NAME: ws-entry-point
: ws://127.0.0.1:8000/ws/v1



*** SUB lobby state

#+begin_src emacs-lisp :var ws=ws-entry-point
  (websocket-client :entry-point ws
                    :route "/game-lobby?status=OPEN&max_players=5")
#+end_src

#+RESULTS:
:  status: CLOSE
: content: {"count":false,"status":"OPEN","max_players":5,"limit":null}


